//--------------------------------------------------------Указатели-------------------------------------------------------
//#include <iostream>
//using namespace std;
//// Указатель - переменная, которая содержит адрес другой переменной или объекта. Обзоначается знаком "*".
//
//void main()
//{
//	system("chcp 1251");
//	int a = 5;
//	int b = a; // просто присвоение значения другой переменной
//	int *pa = &a; // *pa - указатель || & - оператор взятия адреса
//	//double* px = &a; //ОШИБКА!!! НЕСООТВЕТСТВИЕ ТИПОВ ДАННЫХ INT -> DOUBLE
//	cout << "a = " << a << endl;
//	cout << "b = " << b << endl;
//	cout << "pa = " << pa << endl;//Адрес
//	cout << "*pa = " << *pa << endl;//Разыменование
//
//	int* pa2 = &a;
//	cout << "pa2 = " << pa2 << endl;//Адрес
//	cout << "*pa2 = " << *pa2 << endl;//Разыменование
//
//	*pa2 = 2; //Теперь а = 2
//	cout << "a = " << a << endl;
//	cout << "*pa2 = " << *pa2 << endl;
//	cout << "*pa = " << *pa << endl;
//}
//------------------------------------------------------Указатели----------------------------------------------------------
//-----------------------------Арифметика указателей и работа с массивами через указатели----------------------------------
#include <iostream>
using namespace std;

void main()
{
	system("chcp 1251");
	setlocale(LC_ALL, "RU");
	const int SIZE = 5;
	int arr[SIZE]{ 4, 6, 3, 7, 8 };
	for (int i = 0; i < SIZE; i++)
	{
		cout << arr[i] << endl;
	}
	cout << "Первый элемент\t" << /*!!!*/*arr/*!!!*/ << endl;//МАССИВ ЭТО УКАЗАТЕЛЬ!!!
	cout << "Второй элемент\t" << /*!!!*/*(arr + 1)/*!!!*/ << endl;//Алгебра указателей (i=0)+1=(i=1) это 2-й элемент массива
	cout << "Третий элемент\t" << /*!!!*/*(arr + 2)/*!!!*/ << endl;
	cout << "=====================================" << endl;
	int* pArr = arr; //Название массива = адрес первого элемента этого массива
	cout << "arr\t" << arr << endl;
	cout << "pArr\t" << pArr << endl;
	cout << "=====================================" << endl;
	for (int i = 0; i < SIZE; i++)
	{
		cout << *(pArr + i) << endl;//Пример арифметики указателей || "*" - это разыменовка адреса
	}
}
//-----------------------------Арифметика указателей и работа с массивами через указатели----------------------------------