//--------------------------------------------------------Óêàçàòåëè-------------------------------------------------------
//#include <iostream>
//using namespace std;
//// Óêàçàòåëü - ïåðåìåííàÿ, êîòîðàÿ ñîäåðæèò àäðåñ äðóãîé ïåðåìåííîé èëè îáúåêòà. Îáçîíà÷àåòñÿ çíàêîì "*".
//
//void main()
//{
//	int a = 5;
//	int b = a; // ïðîñòî ïðèñâîåíèå çíà÷åíèÿ äðóãîé ïåðåìåííîé
//	int *pa = &a; // *pa - óêàçàòåëü || & - îïåðàòîð âçÿòèÿ àäðåñà
//	//double* px = &a; //ÎØÈÁÊÀ!!! ÍÅÑÎÎÒÂÅÒÑÒÂÈÅ ÒÈÏÎÂ ÄÀÍÍÛÕ INT -> DOUBLE
//	cout << "a = " << a << endl;
//	cout << "b = " << b << endl;
//	cout << "pa = " << pa << endl;//Àäðåñ
//	cout << "*pa = " << *pa << endl;//Ðàçûìåíîâàíèå
//
//	int* pa2 = &a;
//	cout << "pa2 = " << pa2 << endl;//Àäðåñ
//	cout << "*pa2 = " << *pa2 << endl;//Ðàçûìåíîâàíèå
//
//	*pa2 = 2; //Òåïåðü à = 2
//	cout << "a = " << a << endl;
//	cout << "*pa2 = " << *pa2 << endl;
//	cout << "*pa = " << *pa << endl;
//}
//------------------------------------------------------Óêàçàòåëè----------------------------------------------------------
//-----------------------------Àðèôìåòèêà óêàçàòåëåé è ðàáîòà ñ ìàññèâàìè ÷åðåç óêàçàòåëè----------------------------------
#include <iostream>
using namespace std;

void main()
{
	setlocale(LC_ALL, "RU");
 system("chcp 1251");
	const int SIZE = 5;
	int arr[SIZE]{ 4, 6, 3, 7, 8 };
	for (int i = 0; i < SIZE; i++)
	{
		cout << arr[i] << endl;
	}
	cout << "Ïåðâûé ýëåìåíò\t" << /*!!!*/*arr/*!!!*/ << endl;//ÌÀÑÑÈÂ ÝÒÎ ÓÊÀÇÀÒÅËÜ!!!
	cout << "Âòîðîé ýëåìåíò\t" << /*!!!*/*(arr + 1)/*!!!*/ << endl;//Àëãåáðà óêàçàòåëåé (i=0)+1=(i=1) ýòî 2-é ýëåìåíò ìàññèâà
	cout << "Òðåòèé ýëåìåíò\t" << /*!!!*/*(arr + 2)/*!!!*/ << endl;
	cout << "=====================================" << endl;
	int *pArr = arr; //Íàçâàíèå ìàññèâà = àäðåñ ïåðâîãî ýëåìåíòà ýòîãî ìàññèâà
	cout << "arr\t" << arr << endl;
	cout << "pArr\t" << pArr << endl;
	cout << "=====================================" << endl;
	for (int i = 0; i < SIZE; i++)
	{
		cout << *(pArr+i) << endl;//Ïðèìåð àðèôìåòèêè óêàçàòåëåé || "*" - ýòî ðàçûìåíîâêà àäðåñà
	}
}
//-----------------------------Àðèôìåòèêà óêàçàòåëåé è ðàáîòà ñ ìàññèâàìè ÷åðåç óêàçàòåëè----------------------------------